readme.org
#+title:  annt's GNU Emacs Configuration
#+author: anntnzrb
#+email:  anntnzrb@protonmail.com

#+language: en
#+startup:  content indent
#+options:  toc:nil author:t email:t
#+property: header-args :results silent

# macros
#+macro: export-date     (eval (format-time-string "%F" (current-time)))
#+macro: emacs-version   (eval emacs-version)
#+macro: system-features (eval system-configuration-features)

- Creation date: 2020-11-07
- Last update: *{{{export-date}}}*

- /GNU Emacs/ system details
  - version: *{{{emacs-version}}}*
  - build features: *{{{system-features}}}*

* Early initialization

This section is responsible for the initial setup of Emacs. The setup
procedure is executed before the normal configuration loading.

#+begin_src emacs-lisp :tangle "early-init.el"
;; GNU Emacs early initialisation -*- lexical-binding: t; -*-
#+end_src

** Emacs version, features and minimum requirements

The following states the minimum required version of Emacs to use this
configuration.  I do not plan on maintaining older or legacy versions.

#+begin_src emacs-lisp :tangle "early-init.el"
(let ((emacs-version-required "29.1"))
  (cond ((version< emacs-version emacs-version-required)
         (error "Emacs %s or newer is required; you're running %s" emacs-version-required emacs-version))
        ((not (version= emacs-version emacs-version-required))
         (warn "This configuration is tested with Emacs %s; you're running %s" emacs-version-required emacs-version))))
#+end_src

** Startup optimization

The garbage collector in Emacs can sometimes slow down the startup
process. By increasing the =gc-cons-threshold= to its maximum
value and modifying =gc-cons-percentage=, garbage collection is
effectively deferred until Emacs has finished loading. After startup,
these values are reset to more reasonable levels.

#+begin_src emacs-lisp :tangle "early-init.el"
(defvar annt--file-name-handler-alist file-name-handler-alist)
(defvar annt--vc-handled-backends     vc-handled-backends)

(setopt gc-cons-threshold  most-positive-fixnum)
(setopt gc-cons-percentage 0.5)

(setopt file-name-handler-alist nil)
(setopt vc-handled-backends     nil)

(add-hook 'emacs-startup-hook
	  (lambda ()
	    (progn
	      (setopt gc-cons-threshold (* 1024 1024 20))
	      (setopt gc-cons-percentage 0.2)
	      (setopt file-name-handler-alist annt--file-name-handler-alist)
	      (setopt vc-handled-backends annt--vc-handled-backends))))
#+end_src

** Native compilation

Silence some warnings native compilation shouts.

#+begin_src emacs-lisp :tangle "early-init.el"
(when (native-comp-available-p)
  (setopt native-comp-async-report-warnings-errors 'silent)
  (setopt native-compile-prune-cache t))
#+end_src

** Basic frame settings

Very basic UI settings, it's not extensive, as this is not the place to be.

#+begin_src emacs-lisp :tangle "early-init.el"
(setopt inhibit-x-resources         t)
(setopt inhibit-splash-screen       t)
(setopt inhibit-startup-screen      t)
(setopt inhibit-startup-buffer-menu t)
(setopt inhibit-startup-echo-area-message user-login-name)

(setopt frame-resize-pixelwise       t)
(setopt frame-inhibit-implied-resize t)

(setopt frame-title-format '("%b @ emacs"))

(menu-bar-mode   -1)
(tool-bar-mode   -1)
(scroll-bar-mode -1)
#+end_src

*** For information about GNU Emacs and the GNU system, type =C-h C-a=

I don't why this is a thing. Check [[https://yrh.dev/blog/rant-obfuscation-in-emacs/][this]] out.

#+begin_src emacs-lisp :tangle "early-init.el"
(eval-after-load "startup"
  '(fset 'display-startup-echo-area-message (lambda ())))
#+end_src

** Package initialization

#+begin_src emacs-lisp :tangle "early-init.el"
(setopt package-enable-at-startup t)
#+end_src

* Initialization

#+begin_src emacs-lisp :tangle "init.el"
;; GNU Emacs initialisation -*- lexical-binding: t; -*-
#+end_src

The load path is a list of directories that Emacs checks when loading
or requiring libraries. It is used to modularize this Emacs
configuration.

#+begin_src emacs-lisp :tangle "init.el"
(defvar annt/load-dirs '(; "lib/annt"
			 "modules/annt")
  "List of directories containing modules and libraries to add to `load-path'")

(mapc
 (lambda (dir)
   (add-to-list 'load-path (locate-user-emacs-file dir)))
 annt/load-dirs)
#+end_src

The following prompts the user to tangle the literate configuration
file before exiting (restarting) Emacs.

*Q: What is tangl{e,ing} a file?*

*A:* The process of extracting the source code blocks from
 the Org-mode document and writing them out to separate source code
 files.

#+begin_src emacs-lisp :tangle "init.el"
(defvar annt/init--config-literate
  (expand-file-name "readme.org" user-emacs-directory)
  "File path of the literate configuration file.")

(defun annt/init--tangle-literate-config ()
  "Prompt to tangle literate configuration file."
  (interactive)
  (when (and (equal (buffer-file-name) annt/init--config-literate)
             (y-or-n-p "Save and tangle before exiting? "))
    (save-buffer)
    (org-babel-tangle)))

(add-hook 'kill-emacs-hook #'annt/init--tangle-literate-config)
#+end_src

** Helpers and auxiliaries

Section dedicated to providing utility functions (helpers) and macros that
enhance the configuring experience. The primary goal is to simplify and
streamline common tasks, such as, but not limited to, adding =N= functions to
=M= hooks in a single ~add-hook~ expression.

#+begin_src emacs-lisp :tangle "init.el"
(defmacro annt/helpers--add-hook (hooks functions &optional depth local)
  "Replacement and wrapper for `add-hook'.
Add N FUNCTIONS to M HOOKS. Both optional DEPTH and LOCAL arguments are passed
to `add-hook'.

NOTE: The mode hook should not be quoted."
  (let ((hooksp (listp hooks))
        (fnsp   (listp functions)))
    (cond
     ;; both HOOKS and FUNCTIONS are lists
     ((and hooksp fnsp)
      `(mapc (lambda (hk)
               (mapc (lambda (fn)
                       (add-hook 'hk fn ,depth ,local))
                     ,functions))
             ,hooks))

     ;; only HOOKS is a list
     (hooksp
      `(mapc (lambda (hk)
               (add-hook 'hk ,functions ,depth ,local))
             ,hooks))

     ;; only FUNCTIONS is a list
     (fnsp
      `(mapc (lambda (fn)
               (add-hook ',hooks fn ,depth ,local))
             ,functions))

     ;; neither HOOKS nor FUNCTIONS is a list
     ((not (or hooksp fnsp))
      `(add-hook ',hooks ,functions ,depth ,local))

     ;; fallback to error message
     (t `(error "Invalid arguments: hooks and functions should be either a symbol or a list")))))

(defalias 'add-hook! #'annt/helpers--add-hook)
#+end_src

*** Environment

The following serves adding directories to the system's =PATH= that may contain
executables you want Emacs to be able to use.

Examples:

- Nix
- Rust's Cargo
- Haskell's GHCup

#+begin_example
(append-path "~/scripts")
#+end_example

#+begin_src emacs-lisp :tangle "init.el"
;;;###autoload
(defun append-path (path)
  "Add the specified PATH to the `exec-path' and 'PATH' environment variable."
  (let ((expanded-path (expand-file-name path)))
    (if (file-directory-p expanded-path)
        (progn
          (add-to-list 'exec-path expanded-path)
          (setenv "PATH" (concat (getenv "PATH") path-separator expanded-path)))
      (warn "Warning: %s is not a directory" expanded-path))))
#+end_src

*** Content uploading

The following is a convenient tool for sharing text data directly from the Emacs
session. It allows uploading a selected region of text from any buffer directly
to [[https://termbin.com/][termbin]], which is a online service that accepts text data sent to it and
returns a unique URL where the data can be viewed in plain text.

*NOTE*: this tool requires having the =nc= command present on your system; it
should be very easy to install as it is widely packaged.

#+begin_src emacs-lisp :tangle "init.el"
;;;###autoload
(defun termbin-upload (start end)
  "Uploads region between START and END to termbin.com and copies resulting URL.

This function operates asynchronously."
  (interactive "r")
  (let* ((content (buffer-substring-no-properties start end))
         (proc (make-process :name "termbin-upload"
                             :command '("nc" "termbin.com" "9999")
                             :connection-type 'pipe
                             :buffer nil
                             :filter (lambda (_ string)
                                       (let ((trimmed-string (string-trim-right string "[\n\0]+")))
                                         (message "Uploaded and copied URL: %s" trimmed-string)
                                         (kill-new trimmed-string))))))
    (message "Uploading...")
    (process-send-string proc content)
    (process-send-eof proc)))
#+end_src

** Custom(isation)

#+begin_src emacs-lisp :tangle "init.el"
(use-package cus-edit
  :config
  (setopt custom-buffer-done-kill t))
#+end_src

*** Custom file

#+begin_src emacs-lisp :tangle "init.el"
(setopt custom-file (make-temp-file "emacs-custom-file-"))
#+end_src

** Package management

#+begin_src emacs-lisp :tangle "init.el"
(use-package package
  :config
  (setopt package-vc-register-as-project nil)
  (setopt package-archives
          '(("gnu-elpa"       . "https://elpa.gnu.org/packages/")
            ("gnu-elpa-devel" . "https://elpa.gnu.org/devel/")
            ("nongnu"         . "https://elpa.nongnu.org/nongnu/")
            ("melpa"          . "https://melpa.org/packages/")))

  (setopt package-archive-priorities
          '(("gnu-elpa" . 3)
            ("melpa"    . 2)
            ("nongnu"   . 1)))

  ;; disallow built-ins to be externally managed
  (setopt package-install-upgrade-built-in t))
#+end_src

* Personal Modules

My personal modules should be declared here.

#+begin_src emacs-lisp :tangle "init.el"
(require 'annt-mod-simple)
(require 'annt-mod-editing)

(require 'annt-mod-vi)
(require 'annt-mod-org)
(require 'annt-mod-file)
(require 'annt-mod-dired)
(require 'annt-mod-assist)
(require 'annt-mod-modeline)
(require 'annt-mod-appearance)
(require 'annt-mod-completion)
(require 'annt-mod-minibuffer)
#+end_src

** Essentials

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(use-package emacs
  :config

  (setopt read-answer-short t)
  (setopt use-short-answers t)

  ;; reverting/refreshing/updating
  (setopt auto-revert-verbose t)
  (global-auto-revert-mode +1))
#+end_src

*** ~use-package~

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(use-package use-package
  :config
  (setopt use-package-always-defer t)

  ;; force using the "-hook" suffix, this should be default...
  (setopt use-package-hook-name-suffix nil))
#+end_src

*** Emacs as a server

When Emacs is launched, it will now boot its server as well, =emacsclient=. This
allows sharing resources with the initially ran Emacs process. Once Emacs is
killed, the server is too.

I don't particularly use this feature, yet I see it can be handy in some
scenarios, and having the server started does not hurt either.

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(use-package server
  :demand t
  :config
  (setopt server-client-instructions nil)
  (unless (server-running-p)
    (server-start)))
#+end_src

*** Personal prefix

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(defvar-keymap annt-prefix-map
  :doc "annt's prefix keymap with multiple subkeymaps.")

(define-key global-map (kbd "C-z") annt-prefix-map)
#+end_src

*** Backups & Lock files

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(setopt backup-inhibited nil)
(setopt create-lockfiles nil)
(setopt make-backup-files nil)
#+end_src

*** Initial buffer

Start Emacs presented with the =*scratch*= buffer.

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(setopt initial-buffer-choice t)
#+end_src

*** Scratch

By default, the initial buffer =*scratch*= runs the
=lisp-interaction-mode= mode, to write ELisp, obviously.
I honestly see more favorable using a regular text buffer...

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(use-package emacs
  :config
  (setopt initial-major-mode 'text-mode)
  (setopt initial-scratch-message nil))
#+end_src

*** Scroll

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(use-package pixel-scroll
  :demand t
  :config
  (pixel-scroll-precision-mode +1))
#+end_src

*** Help

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(use-package help
  :config
  (setopt help-window-keep-selected t)
  (setopt help-window-select        t))
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-simple.el" :mkdirp yes
(provide 'annt-mod-simple)
#+end_src

** Editing

*** Indentation and the =TAB= key

The following settings are global.  Refer to the language's proper
section for specifics.

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-editing.el" :mkdirp yes
(use-package emacs
  :config
  (setq-default tab-width 4)

  ;; do not use tabs
  (setq-default indent-tabs-mode nil)

  ;; indent behaviour
  (setopt tab-always-indent 'complete)

  ;; req. `tab-always-indent'
  (setopt tab-first-completion 'word-or-paren-or-punct))
#+end_src

*** Text Wrapping and Auto-Fill(ing)

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-editing.el" :mkdirp yes
(use-package emacs
  :config
  (setopt fill-column 80)
  (setopt sentence-end-double-space nil)

  ;; sentences MUST end with a period
  (setopt sentence-end-without-period nil)

  :bind
  (:map ctl-x-map
	("f" . nil)))
#+end_src

*** Miscellaneous

Some other settings that I do not categorize in specifics.

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-editing.el" :mkdirp yes
(use-package emacs
  :init
  (add-hook! emacs-startup-hook '(show-paren-mode))
  :config
  (setopt show-paren-style 'mixed)
  (setopt show-paren-when-point-inside-paren nil)
  (setopt show-paren-context-when-offscreen 'child-frame))
#+end_src

