readme.org
*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-editing.el" :mkdirp yes
(provide 'annt-mod-editing)
#+end_src

** Appearance

*** Themes

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-appearance.el" :mkdirp yes
(use-package ef-themes
  :ensure t
  :demand t
  :config
  (ef-themes-load-random 'dark)

  :bind
  (:map annt-prefix-map
	("a t e SPC" . ef-themes-select)
	("a t e e"   . ef-themes-load-random)))
#+end_src

*** Fonts

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-appearance.el" :mkdirp yes
(use-package fontaine
  :ensure t
  :demand t
  :init
  (setq-default text-scale-remap-header-line t)

  (setopt fontaine-presets
          '((t
             :bold-family nil
             :bold-weight bold
             :italic-family nil
             :italic-slant italic

             :default-family "Iosevka Comfy"
             :default-weight regular
             :default-height 120

             :fixed-pitch-family nil
             :fixed-pitch-weight nil
             :fixed-pitch-height 1.0

             :fixed-pitch-serif-family nil
             :fixed-pitch-serif-weight nil
             :fixed-pitch-serif-height 1.0

             :variable-pitch-family nil
             :variable-pitch-weight nil
             :variable-pitch-height 2.0

             :line-spacing nil)
	    (big
             :default-family "Jetbrains Mono Nerd Font"
             :default-height 180)))

  (fontaine-set-preset 't)

  :bind
  (:map annt-prefix-map
	("a f f" . fontaine-set-face-font)
	("a f SPC" . fontaine-set-preset)))
#+end_src

**** Icons

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-appearance.el" :mkdirp yes
(use-package nerd-icons
  :defer 3
  :ensure t)
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-appearance.el" :mkdirp yes
(provide 'annt-mod-appearance)
#+end_src

** Minibuffer

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-minibuffer.el" :mkdirp yes
(use-package minibuffer
  :config
  (setopt minibuffer-default-prompt-format " [%s]")
  (setopt resize-mini-windows t)

  ;; save minibuffer history across sessions
  (setopt history-length t)
  (setopt history-delete-duplicates t)
  (savehist-mode +1)

  ;; hide default value when typing
  (minibuffer-electric-default-mode +1)

  ;; remove "shadow" greyed out parts
  (file-name-shadow-mode +1)

  :bind
  (:map minibuffer-mode-map
        ;; unlikely to use an actual tab character, so prefer completion
        ("M-\\" . dabbrev-expand)))
#+end_src

*** Vertico

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-minibuffer.el" :mkdirp yes
(use-package vertico
  :ensure t
  :config
  (setopt vertico-cycle    t)
  (setopt vertico-count   12)
  (setopt vertico-resize nil)
  (setopt vertico-scroll-margin (/ vertico-count 2))
  (setopt vertico-sort-function 'vertico-sort-history-length-alpha)

  :bind
  (:map vertico-map
	("C-j" . vertico-next)
	("C-k" . vertico-previous))

  :init
  (vertico-mode +1))
#+end_src

*** Marginalia

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-minibuffer.el" :mkdirp yes
(use-package marginalia
  :ensure t
  :defer 1
  :config
  (setopt marginalia-align  'left)
  (setopt marginalia-separator "    ")
  (setopt marginalia-max-relative-age 0)

  (marginalia-mode +1))
#+end_src

*** Icons

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-completion.el" :mkdirp yes
(use-package nerd-icons-completion
  :ensure t
  :defer 3
  :config
  (nerd-icons-completion-mode +1))

(use-package nerd-icons-completion
  :ensure t
  :after marginalia
  :config
  (nerd-icons-completion-marginalia-setup))
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-minibuffer.el" :mkdirp yes
(provide 'annt-mod-minibuffer)
#+end_src

** Modeline

*** Keycast

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-modeline.el" :mkdirp yes
(use-package keycast
  :ensure t
  :defer 2
  :config
  (setopt keycast-mode-line-format "%k%c%R")
  ;; don't hide rest of the modeline
  (setopt keycast-mode-line-remove-tail-elements nil) 

  (defconst annt--keycast-events-disabled
    '(mouse-event-p
      mouse-movement-p
      mwheel-scroll
      pixel-scroll-precision
      pixel-scroll-start-momentum)
    "List of disabled events that keycast should ignore.")

  (defconst annt--keycast-events-typing
    '(self-insert-command
      org-self-insert-command
      isearch-printing-char
      isearch-delete-char)
    "List of disabled events that keycast should interpret as typing.")

  (mapc (lambda (ev)
          (add-to-list 'keycast-substitute-alist `(,ev nil nil)))
        annt--keycast-events-disabled)

  (mapc (lambda (ev)
          (add-to-list 'keycast-substitute-alist `(,ev "." "Typing…")))
        annt--keycast-events-typing)

  (keycast-mode +1)

  :bind
  (:map annt-prefix-map
        ("m k" . keycast-mode)))
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-modeline.el" :mkdirp yes
(provide 'annt-mod-modeline)
#+end_src


** Completion

Suggested resources:
- =completion-styles=
- [[https://www.youtube.com/live/fnE0lXoe7Y0?si=29m2wSpmF-O1FwUN][Emacs Completion Explained - Andrew Tropin]]

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-completion.el" :mkdirp yes
(use-package emacs
  :config
  (setopt completion-styles '(basic substring initials flex partial-completion orderless))

  ;; do not need anything case-specific most of the time (?)
  (setopt completion-ignore-case                t)
  (setopt read-buffer-completion-ignore-case    t)
  (setopt read-file-name-completion-ignore-case t))
#+end_src

*** Orderless

Check the pertintent section regarding =completion-styles=.

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-completion.el" :mkdirp yes
(use-package orderless
  :ensure t
  :defer 2
  :config
  (setopt orderless-matching-styles
          '(orderless-prefixes orderless-regexp)))
#+end_src

*** Corfu

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-completion.el" :mkdirp yes
(use-package corfu
  :ensure t
  :config
  (setopt corfu-auto  t)
  (setopt corfu-count 8)
  (setopt corfu-cycle t)

  (setopt corfu-min-width   20)
  (setopt corfu-auto-delay  0.1)
  (setopt corfu-auto-prefix 2)

  ;; popupinfo
  (setopt corfu-popupinfo-delay '(1.5 . 0.5))

  :bind
  (:map corfu-map
        ;; ignores completion candidates and jumping to newline
        ("M-<return>" . newline))
  :init
  (global-corfu-mode    +1)
  (corfu-popupinfo-mode +1))
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-completion.el" :mkdirp yes
(provide 'annt-mod-completion)
#+end_src

** Assistance

*** which-key

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-assist.el" :mkdirp yes
(use-package which-key
  :ensure t
  :defer 2
  :config
  (setopt which-key-lighter           "")
  (setopt which-key-separator     " ➡ ")
  (setopt which-key-prefix-prefix "... ")

  (setopt which-key-add-column-padding     16)
  (setopt which-key-max-display-columns     4)
  (setopt which-key-max-description-length 40)

  ;; timings
  (setopt which-key-idle-delay            0.5)
  (setopt which-key-idle-secondary-delay 0.25)

  (which-key-mode +1))
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-assist.el" :mkdirp yes
(provide 'annt-mod-assist)
#+end_src

** Dired

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-dired.el" :mkdirp yes
(use-package dired
  :init
  (add-hook! dired-mode-hook '(dired-hide-details-mode hl-line-mode))

  :config
  (setopt dired-recursive-copies    'always)
  (setopt dired-recursive-deletes   'always)
  (setopt delete-by-moving-to-trash t)

  ;; do not display available space (top)
  (setopt dired-free-space nil)

  ;; update dired contents when directory contens change
  (setopt dired-auto-revert-buffer #'dired-directory-changed-p)

  ;; `man' ls for extra flags info 
  (setopt dired-listing-switches
          "-AGFhlv --group-directories-first --time-style=long-iso")

  ;; smart dired
  (setopt dired-dwim-target t)

  ;; when renaming (mv) a vc-controlled file, use vc mv over traditional mv
  (setopt dired-vc-rename-file t)

  ;; offer creating specified directory paths if missing
  (setopt dired-create-destination-dirs 'always)
  (setopt dired-create-destination-dirs-on-trailing-dirsep t)

  :bind
  (:map dired-mode-map
        ("C-+" . dired-create-empty-file)))
#+end_src

*** Extras

**** Writable Dired

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-dired.el" :mkdirp yes
(use-package wdired
  :after dired
  :config
  (setopt wdired-allow-to-change-permissions t)
  (setopt wdired-create-parent-directories   t))
#+end_src

**** Dired Tree

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-dired.el" :mkdirp yes
(use-package dired-subtree
  :ensure t
  :after dired
  :bind
  (:map dired-mode-map
        ("<tab>"     . dired-subtree-toggle)
        ("<backtab>" . dired-subtree-remove)))
#+end_src

**** Icons

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-dired.el" :mkdirp yes
(use-package nerd-icons-dired
  :ensure t
  :after dired
  :init
  (add-hook! dired-mode-hook '(nerd-icons-dired-mode)))
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-dired.el" :mkdirp yes
(provide 'annt-mod-dired)
#+end_src

** Org

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-org.el" :mkdirp yes
(use-package org
  :config
  (setopt org-src-window-setup       'current-window)
  (setopt org-src-fontify-natively   t)
  (setopt org-confirm-babel-evaluate nil)

  ;; identation
  (setopt org-src-preserve-indentation     t)
  (setopt org-edit-src-content-indentation 0)

  ;; use major mode
  (setopt org-src-tab-acts-natively t))
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-org.el" :mkdirp yes
(provide 'annt-mod-org)
#+end_src

