readme.org
** Vi[m] emulation

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-vi.el" :mkdirp yes
(use-package evil
  :ensure t
  :demand t
  :init
  (setopt evil-echo-state      nil)
  (setopt evil-overriding-maps nil)
  (setopt evil-want-fine-undo    t)
  (setopt evil-want-keybinding nil)
  (setopt evil-want-minibuffer nil)

  ;; native undo-redo
  (setopt evil-undo-system 'undo-redo)

  (evil-mode +1)

  :bind
  (:map evil-motion-state-map
	("C-z" . nil)))
#+end_src

*** Extras

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-vi.el" :mkdirp yes
(use-package evil-collection
  :ensure t
  :demand t
  :after evil
  :config
  (setopt evil-collection-want-unimpaired-p nil)

  (evil-collection-init))
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-vi.el" :mkdirp yes
(provide 'annt-mod-vi)
#+end_src

** Files, Projects and Queries

*** Searching and Replacing

**** Consult

Suggested resources:

- [[https://youtu.be/f2mQXNnChwc?si=7yCMeU3-0W2qnFR6][Emacs: search and replace basics - Protesilaos]]

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-file.el" :mkdirp yes
(use-package consult
  :ensure t
  :bind
  (:map goto-map
	    ("i"   . consult-imenu)
	    ("g"   . consult-goto-line)
	    ("M-g" . consult-goto-line)
	    ("o"   . consult-outline))
  (:map search-map
	    ("@"   . consult-kmacro)
	    ("d"   . consult-fd)
	    ("g"   . consult-ripgrep)
	    ("s"   . consult-line)
	    ("M-s" . consult-line)
        ("i" . consult-info))
  (:map ctl-x-map
	    ("b" . consult-buffer)

        ;; ctl-x-4-map
	    ("4 b" . consult-buffer-other-window)

        ;; ctl-x-r-map
	    ("r b" . consult-bookmark)

        ;; project map
	    ("p b" . consult-project-buffer))
  (:map minibuffer-local-map
        ("M-r" . consult-history))
  (:map annt-prefix-map
        ("a t t" . consult-theme)))
#+end_src

*** Version Control

**** Magit

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-file.el" :mkdirp yes
(use-package magit
  :ensure t
  :config
  (setopt magit-define-global-key-bindings nil)

  :bind
  (:map annt-prefix-map
	    ("g g" . magit-status)))
#+end_src

*** Projects

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-file.el" :mkdirp yes
(use-package project
  :config
  (setopt project-kill-buffers-display-buffer-list t))
#+end_src

*** Provide

#+begin_src emacs-lisp :tangle "modules/annt/annt-mod-file.el" :mkdirp yes
(provide 'annt-mod-file)
#+end_src
